{
  "MyNextRead":
  [
    {"BookCover":"gothic.jpg", "BookTitle":"Mexican Gothic", "BookAuthor":"Silvia Moreno-Garcia", "BookSeries":"N/A", "BookGenre":"Horror", "BookRating":3.70, "BookPrice":23.99, "BookLink":"https://www.goodreads.com/book/show/53152636-mexican-gothic?ac=1&from_search=true&qid=veTiShweyv&rank=1", "BookDescription":"After receiving a frantic letter from her newly-wed cousin begging for someone to save her from a mysterious doom, Noemí Taboada heads to High Place, a distant house in the Mexican countryside. She’s not sure what she will find—her cousin’s husband, a handsome Englishman, is a stranger, and Noemí knows little about the region. Noemí is also an unlikely rescuer: She’s a glamorous debutante, and her chic gowns and perfect red lipstick are more suited for cocktail parties than amateur sleuthing. But she’s also tough and smart, with an indomitable will, and she is not afraid: Not of her cousin’s new husband, who is both menacing and alluring; not of his father, the ancient patriarch who seems to be fascinated by Noemí; and not even of the house itself, which begins to invade Noemí’s dreams with visions of blood and doom. Her only ally in this inhospitable abode is the family’s youngest son. Shy and gentle, he seems to want to help Noemí, but might also be hiding dark knowledge of his family’s past. For there are many secrets behind the walls of High Place. The family’s once colossal wealth and faded mining empire kept them from prying eyes, but as Noemí digs deeper she unearths stories of violence and madness. And Noemí, mesmerized by the terrifying yet seductive world of High Place, may soon find it impossible to ever leave this enigmatic house behind."},
    {"BookCover":"guest.jpg", "BookTitle":"The Guest List", "BookAuthor":"Lucy Foley", "BookSeries":"N/A", "BookGenre":"Mystery & Thriller", "BookRating":3.86, "BookPrice":21.99, "BookLink":"https://www.goodreads.com/book/show/51933429-the-guest-list?ac=1&from_search=true&qid=vC3nCbIFHF&rank=1", "BookDescription":"On an island off the coast of Ireland, guests gather to celebrate two people joining their lives together as one. The groom: handsome and charming, a rising television star. The bride: smart and ambitious, a magazine publisher. It’s a wedding for a magazine, or for a celebrity: the designer dress, the remote location, the luxe party favors, the boutique whiskey. The cell phone service may be spotty and the waves may be rough, but every detail has been expertly planned and will be expertly executed. But perfection is for plans, and people are all too human. As the champagne is popped and the festivities begin, resentments and petty jealousies begin to mingle with the reminiscences and well wishes. The groomsmen begin the drinking game from their school days. The bridesmaid not-so-accidentally ruins her dress. The bride’s oldest (male) friend gives an uncomfortably caring toast. And then someone turns up dead. Who didn’t wish the happy couple well? And perhaps more important, why?"}
  ]
  "Status":"OK"
}
