{
  "MyNextRead":
  [
    {"BookCover":"blade.jpg", "BookTitle":"The Bird and the Blade", "BookAuthor":"Megan Bannen", "BookSeries":"N/A", "BookGenre":"YA Fantasy", "BookRating":4.05, "BookPrice":17.99, "BookLink":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1508187186l/32702487._SY475_.jpg", "BookDescription":"As a slave in the Kipchak Khanate, Jinghua has lost everything: her home, her family, her freedom … until the kingdom is conquered by enemy forces and she finds herself an unlikely conspirator in the escape of Prince Khalaf and his irascible father across the vast Mongol Empire. On the run, with adversaries on all sides and an endless journey ahead, Jinghua hatches a scheme to use the Kipchaks’ exile to return home, a plan that becomes increasingly fraught as her feelings for Khalaf evolve into a hopeless love. Jinghua’s already dicey prospects take a downward turn when Khalaf seeks to restore his kingdom by forging a marriage alliance with Turandokht, the daughter of the Great Khan. As beautiful as she is cunning, Turandokht requires all potential suitors to solve three impossible riddles to win her hand—and if they fail, they die. Jinghua has kept her own counsel well, but with Khalaf’s kingdom—and his very life—on the line, she must reconcile the hard truth of her past with her love for a boy who has no idea what she’s capable of ... even if it means losing him to the girl who’d sooner take his life than his heart."},
    {"BookCover":"beach.jpg", "BookTitle":"Beach Read", "BookAuthor":"Emily Henry", "BookSeries":"N/A", "BookGenre":"Romance", "BookRating":4.06, "BookPrice":16.00, "BookLink":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1589881197l/52867387._SY475_.jpg", "BookDescription":"A romance writer who no longer believes in love and a literary writer stuck in a rut engage in a summer-long challenge that may just upend everything they believe about happily ever afters. Augustus Everett is an acclaimed author of literary fiction. January Andrews writes bestselling romance. When she pens a happily ever after, he kills off his entire cast. They’re polar opposites. In fact, the only thing they have in common is that for the next three months, they're living in neighboring beach houses, broke, and bogged down with writer's block. Until, one hazy evening, one thing leads to another and they strike a deal designed to force them out of their creative ruts: Augustus will spend the summer writing something happy, and January will pen the next Great American Novel. She’ll take him on field trips worthy of any rom-com montage, and he’ll take her to interview surviving members of a backwoods death cult (obviously). Everyone will finish a book and no one will fall in love. Really. "},
    {"BookCover":"swift.jpg", "BookTitle":"Soulswift", "BookAuthor":"Megan Bannen", "BookSeries":"N/A", "BookGenre":"YA Fantasy", "BookRating":4.02, "BookPrice":17.99, "BookLink":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1583508630l/51475325.jpg", "BookDescription":"Gelya is a Vessel, a girl who channels the word of the One True God through song. Cloistered with the other Vessels of her faith, she believes—as all Ovinists do—that a saint imprisoned Elath the Great Demon centuries ago, saving humanity from earthly temptation. When Gelya stumbles into a deadly cover-up by the Ovinists’ military, she reluctantly teams up with Tavik, an enemy soldier, to survive. Tavik believes that Elath is actually a mother goddess who must be set free, but while he succeeds in opening Her prison, he inadvertently turns Gelya into Elath’s unwilling human vessel. Now the church that raised Gelya considers her a threat. In a race against the clock, she and Tavik must find a way to exorcise Elath’s presence from her body. But will this release stop the countdown to the end of the world, or will it be the cause of the earth’s destruction? And as Tavik and Gelya grow closer, another question lingers between them: What will become of Gelya?"},
    {"BookCover":"gothic.jpg", "BookTitle":"Mexican Gothic", "BookAuthor":"Silvia Moreno-Garcia", "BookSeries":"N/A", "BookGenre":"Horror", "BookRating":3.70, "BookPrice":23.99, "BookLink":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1607462569l/53152636._SY475_.jpg", "BookDescription":"After receiving a frantic letter from her newly-wed cousin begging for someone to save her from a mysterious doom, Noemí Taboada heads to High Place, a distant house in the Mexican countryside. She’s not sure what she will find—her cousin’s husband, a handsome Englishman, is a stranger, and Noemí knows little about the region. Noemí is also an unlikely rescuer: She’s a glamorous debutante, and her chic gowns and perfect red lipstick are more suited for cocktail parties than amateur sleuthing. But she’s also tough and smart, with an indomitable will, and she is not afraid: Not of her cousin’s new husband, who is both menacing and alluring; not of his father, the ancient patriarch who seems to be fascinated by Noemí; and not even of the house itself, which begins to invade Noemí’s dreams with visions of blood and doom. Her only ally in this inhospitable abode is the family’s youngest son. Shy and gentle, he seems to want to help Noemí, but might also be hiding dark knowledge of his family’s past. For there are many secrets behind the walls of High Place. The family’s once colossal wealth and faded mining empire kept them from prying eyes, but as Noemí digs deeper she unearths stories of violence and madness. And Noemí, mesmerized by the terrifying yet seductive world of High Place, may soon find it impossible to ever leave this enigmatic house behind."},
    {"BookCover":"guest.jpg", "BookTitle":"The Guest List", "BookAuthor":"Lucy Foley", "BookSeries":"N/A", "BookGenre":"Mystery & Thriller", "BookRating":3.86, "BookPrice":21.99, "BookLink":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1580194251l/51933429.jpg", "BookDescription":"On an island off the coast of Ireland, guests gather to celebrate two people joining their lives together as one. The groom: handsome and charming, a rising television star. The bride: smart and ambitious, a magazine publisher. It’s a wedding for a magazine, or for a celebrity: the designer dress, the remote location, the luxe party favors, the boutique whiskey. The cell phone service may be spotty and the waves may be rough, but every detail has been expertly planned and will be expertly executed. But perfection is for plans, and people are all too human. As the champagne is popped and the festivities begin, resentments and petty jealousies begin to mingle with the reminiscences and well wishes. The groomsmen begin the drinking game from their school days. The bridesmaid not-so-accidentally ruins her dress. The bride’s oldest (male) friend gives an uncomfortably caring toast. And then someone turns up dead. Who didn’t wish the happy couple well? And perhaps more important, why?"},
    {"BookCover":"city.jpg", "BookTitle":"House of Earth and Blood", "BookAuthor":"Sarah J. Maas", "BookSeries":"Crescent City #1", "BookGenre":"Fantasy", "BookRating":4.43, "BookPrice":21.99, "BookLink":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1559142847l/44778083.jpg", "BookDescription":"Bryce Quinlan had the perfect life—working hard all day and partying all night—until a demon murdered her closest friends, leaving her bereft, wounded, and alone. When the accused is behind bars but the crimes start up again, Bryce finds herself at the heart of the investigation. She’ll do whatever it takes to avenge their deaths. Hunt Athalar is a notorious Fallen angel, now enslaved to the Archangels he once attempted to overthrow. His brutal skills and incredible strength have been set to one purpose—to assassinate his boss’s enemies, no questions asked. But with a demon wreaking havoc in the city, he’s offered an irresistible deal: help Bryce find the murderer, and his freedom will be within reach. As Bryce and Hunt dig deep into Crescent City’s underbelly, they discover a dark power that threatens everything and everyone they hold dear, and they find, in each other, a blazing passion—one that could set them both free, if they’d only let it. With unforgettable characters, sizzling romance, and page-turning suspense, this richly inventive new fantasy series by #1 New York Times bestselling author Sarah J. Maas delves into the heartache of loss, the price of freedom—and the power of love."}
  ],
  "Status":"OK"
}
